---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadData.ApparentLoad
source: html/0a538386-e10f-be9d-ba3b-c81093006256.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadData.ApparentLoad Property

The electrical apparent load of the area based load.

## Syntax (C#)
```csharp
public double ApparentLoad { get; }
```